meeting/minutes/2024/03-26-editors.org
:PROPERTIES:
:ID:       E03506E4-5603-4749-8C84-809C4BAC00E0
:END:
#+title: QT4 CG Editor’s Meeting Minutes 2024-03-26
#+author: Norm Tovey-Walsh
#+filetags: :qt4cg:
#+options: html-style:nil h:6
#+html_head: <link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
#+html_head: <link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
#+html_head: <link rel="shortcut icon" href="/img/QT4-64.png" />
#+html_head: <link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
#+options: author:nil email:nil creator:nil timestamp:nil
#+startup: showall

[[../][Meeting index]] / [[https://qt4cg.org][QT4CG.org]] / [[https://qt4cg.org/dashboard][Dashboard]] / [[https://github.com/qt4cg/qtspecs/issues][GH Issues]] / [[https://github.com/qt4cg/qtspecs/pulls][GH Pull Requests]]

* Draft Minutes
:PROPERTIES:
:unnumbered: t
:CUSTOM_ID: minutes
:END:

* Administrivia
:PROPERTIES:
:CUSTOM_ID: administrivia
:END:

** Roll call [6/6]
:PROPERTIES:
:CUSTOM_ID: roll-call
:END:

+ [X] Christian Grün (CG)
+ [X] Joel Kalvesmaki (JK)
+ [X] Michael Kay (MK)
+ [X] John Lumley (JLY)
+ [X] C. M. Sperberg-McQueen (MSM)
+ [X] Norm Tovey-Walsh (NW). /Scribe/. /Chair/.

This meeting was as much discussion as anything else. The scribe has attempted
to record actions and salient points, but not all of the discussion.

** Construct an agenda
:PROPERTIES:
:CUSTOM_ID: agenda
:END:

After some initial discussion, we move on to reviewing some aspects of the test suite.

** Review of the test suite
:PROPERTIES:
:CUSTOM_ID: h-9EA94D10-4A2B-4973-92D0-731599A2F588
:END:

MK reviews what’s in the test suite repository.

The directories:

+ ~app~ - a collection of “application” tests derived from real world queries
   + Also contains examples that come from the specification
   + ~fo-spec-examples.xml~ is generated from the spec
   + ~CatalogCheck.xml~ is introspective, it checks the integrity of the test suite metadata
+ ~array~ - collections of tests
   + One test-set file for each function in the relevant namespace
+ ~docs~ - a collection of source documents used across test sets
   + Environments point to source documents by relative URI.
+ ~drivers~ - Test drivers published by vendors
   + NW offers to help JK get the Saxon test suite running
   + CG offers to update the readme for the BaseX test driver
   + XSLT version exists for SaxonJS, maybe publish here?
+ ~fn~ - collections of tests 
+ ~guide~ - obsolete documentation
   + How to submit new tests
   + How to run tests
   + How to report test suite results
   + Lots of good information in here, but not fully up-to-date; hard to say what effort would be required to polish it.
+ ~map~ - collections of tests 
+ ~math~ - collections of tests 
+ ~misc~ - collections of tests 
+ ~op~ - collections of tests 
+ ~prod~ - collections of tests 
+ ~reports~ - output of a program to analyze to 
    + Perhaps remove it?
+ ~results~ - 
    + Raw data for the reports
    + Perhaps remove it?
+ ~ser~ - collections of tests
+ ~tools~ - a mixed bag of things, including stylesheets that have
    historically been used to convert tests from other formats.
+ ~upd~ - collections of tests
    + These have now been integrated into the main XQuery test suite
+ ~viewer~ - Interactive browsing of the test suite
    + JL to see if he can get it working again
+ ~xs~ - collections of tests

The files:

+ ~Overview.html~ & ~README.md~, should be reconciled
  + NW proposes that the HTML should be folded into ~README.md~ and then removed.
  + JK agrees to attempt to reconcile them.
+ changes.xml - used to track completeness of the test suite wrt the spec
  + We’re moving in the direction of tagging tests directly against the PR they implement
  + Every new 4.0 test should have a ~covers-40~ attribute
    + Used to be a name that pointed into ~changes.xml~
    + Now moving towards using PR numbers ~changes-40="PR306"~.
    + Can get rid of ~changes.xml~ after all the tests haver been tagged.

More notes

+ JK: I added some Oxygen configuration to run transformations and Schematron tests 
  + Add a Schematron file that warns of duplicate tests
  + I’d also like a ~desiderata~ with ~desideratum~s that identify tests that haven’t been written but should be.
+ NW: We have PRs marked “tests needed”, that’s where I’d look
+ MSM: Tagging the PR or raising an issue would be enough, I think.

The ~grammar.xml~ could be simplified so that it only contains the 4.0 grammar.
The other versions are available elsewhere and are probably not correct here
anymore.

* Any other business
:PROPERTIES:
:CUSTOM_ID: any-other-business
:END:

None heard.

* Adjourned
:PROPERTIES:
:CUSTOM_ID: adjourned
:END:
