meeting/minutes/2024/03-26-editors.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>QT4 CG Editor’s Meeting Minutes 2024-03-26</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
<link rel="shortcut icon" href="/img/QT4-64.png" />
<link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
<link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
<link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
<link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">QT4 CG Editor’s Meeting Minutes 2024-03-26</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#minutes">Draft Minutes</a></li>
<li><a href="#administrivia">1. Administrivia</a>
<ul>
<li><a href="#roll-call">1.1. Roll call <code>[6/6]</code></a></li>
<li><a href="#agenda">1.2. Construct an agenda</a></li>
<li><a href="#h-9EA94D10-4A2B-4973-92D0-731599A2F588">1.3. Review of the test suite</a></li>
</ul>
</li>
<li><a href="#any-other-business">2. Any other business</a></li>
<li><a href="#adjourned">3. Adjourned</a></li>
</ul>
</div>
</div>
<p>
<a href="../">Meeting index</a> / <a href="https://qt4cg.org">QT4CG.org</a> / <a href="https://qt4cg.org/dashboard">Dashboard</a> / <a href="https://github.com/qt4cg/qtspecs/issues">GH Issues</a> / <a href="https://github.com/qt4cg/qtspecs/pulls">GH Pull Requests</a>
</p>

<div id="outline-container-minutes" class="outline-2">
<h2 id="minutes">Draft Minutes</h2>
<div class="outline-text-2" id="text-minutes">
</div>
</div>

<div id="outline-container-administrivia" class="outline-2">
<h2 id="administrivia"><span class="section-number-2">1.</span> Administrivia</h2>
<div class="outline-text-2" id="text-administrivia">
</div>

<div id="outline-container-roll-call" class="outline-3">
<h3 id="roll-call"><span class="section-number-3">1.1.</span> Roll call <code>[6/6]</code></h3>
<div class="outline-text-3" id="text-roll-call">
<ul class="org-ul">
<li class="on"><code>[X]</code> Christian Grün (CG)</li>
<li class="on"><code>[X]</code> Joel Kalvesmaki (JK)</li>
<li class="on"><code>[X]</code> Michael Kay (MK)</li>
<li class="on"><code>[X]</code> John Lumley (JLY)</li>
<li class="on"><code>[X]</code> C. M. Sperberg-McQueen (MSM)</li>
<li class="on"><code>[X]</code> Norm Tovey-Walsh (NW). <i>Scribe</i>. <i>Chair</i>.</li>
</ul>

<p>
This meeting was as much discussion as anything else. The scribe has attempted
to record actions and salient points, but not all of the discussion.
</p>
</div>
</div>

<div id="outline-container-agenda" class="outline-3">
<h3 id="agenda"><span class="section-number-3">1.2.</span> Construct an agenda</h3>
<div class="outline-text-3" id="text-agenda">
<p>
After some initial discussion, we move on to reviewing some aspects of the test suite.
</p>
</div>
</div>

<div id="outline-container-h-9EA94D10-4A2B-4973-92D0-731599A2F588" class="outline-3">
<h3 id="h-9EA94D10-4A2B-4973-92D0-731599A2F588"><span class="section-number-3">1.3.</span> Review of the test suite</h3>
<div class="outline-text-3" id="text-h-9EA94D10-4A2B-4973-92D0-731599A2F588">
<p>
MK reviews what’s in the test suite repository.
</p>

<p>
The directories:
</p>

<ul class="org-ul">
<li><code>app</code> - a collection of “application” tests derived from real world queries
<ul class="org-ul">
<li>Also contains examples that come from the specification</li>
<li><code>fo-spec-examples.xml</code> is generated from the spec</li>
<li><code>CatalogCheck.xml</code> is introspective, it checks the integrity of the test suite metadata</li>
</ul></li>
<li><code>array</code> - collections of tests
<ul class="org-ul">
<li>One test-set file for each function in the relevant namespace</li>
</ul></li>
<li><code>docs</code> - a collection of source documents used across test sets
<ul class="org-ul">
<li>Environments point to source documents by relative URI.</li>
</ul></li>
<li><code>drivers</code> - Test drivers published by vendors
<ul class="org-ul">
<li>NW offers to help JK get the Saxon test suite running</li>
<li>CG offers to update the readme for the BaseX test driver</li>
<li>XSLT version exists for SaxonJS, maybe publish here?</li>
</ul></li>
<li><code>fn</code> - collections of tests</li>
<li><code>guide</code> - obsolete documentation
<ul class="org-ul">
<li>How to submit new tests</li>
<li>How to run tests</li>
<li>How to report test suite results</li>
<li>Lots of good information in here, but not fully up-to-date; hard to say what effort would be required to polish it.</li>
</ul></li>
<li><code>map</code> - collections of tests</li>
<li><code>math</code> - collections of tests</li>
<li><code>misc</code> - collections of tests</li>
<li><code>op</code> - collections of tests</li>
<li><code>prod</code> - collections of tests</li>
<li><code>reports</code> - output of a program to analyze to 
<ul class="org-ul">
<li>Perhaps remove it?</li>
</ul></li>
<li><code>results</code> - 
<ul class="org-ul">
<li>Raw data for the reports</li>
<li>Perhaps remove it?</li>
</ul></li>
<li><code>ser</code> - collections of tests</li>
<li><code>tools</code> - a mixed bag of things, including stylesheets that have
historically been used to convert tests from other formats.</li>
<li><code>upd</code> - collections of tests
<ul class="org-ul">
<li>These have now been integrated into the main XQuery test suite</li>
</ul></li>
<li><code>viewer</code> - Interactive browsing of the test suite
<ul class="org-ul">
<li>JL to see if he can get it working again</li>
</ul></li>
<li><code>xs</code> - collections of tests</li>
</ul>

<p>
The files:
</p>

<ul class="org-ul">
<li><code>Overview.html</code> &amp; <code>README.md</code>, should be reconciled
<ul class="org-ul">
<li>NW proposes that the HTML should be folded into <code>README.md</code> and then removed.</li>
<li>JK agrees to attempt to reconcile them.</li>
</ul></li>
<li>changes.xml - used to track completeness of the test suite wrt the spec
<ul class="org-ul">
<li>We’re moving in the direction of tagging tests directly against the PR they implement</li>
<li>Every new 4.0 test should have a <code>covers-40</code> attribute
<ul class="org-ul">
<li>Used to be a name that pointed into <code>changes.xml</code></li>
<li>Now moving towards using PR numbers <code>changes-40="PR306"</code>.</li>
<li>Can get rid of <code>changes.xml</code> after all the tests haver been tagged.</li>
</ul></li>
</ul></li>
</ul>

<p>
More notes
</p>

<ul class="org-ul">
<li>JK: I added some Oxygen configuration to run transformations and Schematron tests 
<ul class="org-ul">
<li>Add a Schematron file that warns of duplicate tests</li>
<li>I’d also like a <code>desiderata</code> with ~desideratum~s that identify tests that haven’t been written but should be.</li>
</ul></li>
<li>NW: We have PRs marked “tests needed”, that’s where I’d look</li>
<li>MSM: Tagging the PR or raising an issue would be enough, I think.</li>
</ul>

<p>
The <code>grammar.xml</code> could be simplified so that it only contains the 4.0 grammar.
The other versions are available elsewhere and are probably not correct here
anymore.
</p>
</div>
</div>
</div>

<div id="outline-container-any-other-business" class="outline-2">
<h2 id="any-other-business"><span class="section-number-2">2.</span> Any other business</h2>
<div class="outline-text-2" id="text-any-other-business">
<p>
None heard.
</p>
</div>
</div>

<div id="outline-container-adjourned" class="outline-2">
<h2 id="adjourned"><span class="section-number-2">3.</span> Adjourned</h2>
<div class="outline-text-2" id="text-adjourned">
</div>
</div>
</div>
</body>
</html>
